class Dress{
  final String title;
  final String image;
  final String description;
  final int price;
  final int rating;
  bool isMarked;
  Dress({
   this.title,
   this.image,
   this.description,
   this.price,
   this.rating,
   this.isMarked
});
}
List<Dress>popularList=[
  Dress(
    title: 'မင်္ဂလာဆောင်ဝတ်စုံ ၀၁',
    image: 'assets/images/1.jpg',
    price: 400000,
    rating: 5,
    isMarked: false,
    description: 'ပုဂံခေတ်တွင်အထည်အများဆုံးအသုံးပြုသည့်အထည်ဖြစ်ပြီးဝါ၊ပိုး၊ဖဲနှင့်ကတ္တီပါစသည့်အခြားအထည်အလိပ်များကိုလည်းမြန်မာအဝတ်အထည်များတွင်အသုံးပြုသည်။အိမ်နီးချင်းလူ့အဖွဲ့အစည်းများနှင့်ကုန်သွယ်မှုသည်ပျူခေတ်နှင့်ကုန်သွားပြီးရိုးရာဓလေ့ထုံးစံနှင့်၀တ်စုံအတွက်အသုံးပြုသည့်တင်သွင်းသည့်အထည်အလိပ်များဖြင့်ပစ္စည်းယဉ်ကျေးမှုကိုပိုမိုကောင်းမွန်စေသည်။သာဓကအားဖြင့်နာနတ်သီဟက်ပီနန်းစံစဉ်ကတည်ဆောက်ခဲ့သောမင်္ဂလာဒုံဘုရားတွင်ပြည်တွင်း၌ထုတ်လုပ်ခြင်းမရှိသောဖဲနှင့်ကတ္တီပါအ၀တ်အထည်များပါ၀င်သည်။'
  ),
  Dress(
    title: 'မင်္ဂလာဆောင်ဝတ်စုံ ၀၂',
    image: 'assets/images/2.jpg',
    price: 300000,
    rating: 4,
    isMarked: false,
    description: 'ပုဂံခေတ်တွင်အထည်အများဆုံးအသုံးပြုသည့်အထည်ဖြစ်ပြီးဝါ၊ပိုး၊ဖဲနှင့်ကတ္တီပါစသည့်အခြားအထည်အလိပ်များကိုလည်းမြန်မာအဝတ်အထည်များတွင်အသုံးပြုသည်။အိမ်နီးချင်းလူ့အဖွဲ့အစည်းများနှင့်ကုန်သွယ်မှုသည်ပျူခေတ်နှင့်ကုန်သွားပြီးရိုးရာဓလေ့ထုံးစံနှင့်၀တ်စုံအတွက်အသုံးပြုသည့်တင်သွင်းသည့်အထည်အလိပ်များဖြင့်ပစ္စည်းယဉ်ကျေးမှုကိုပိုမိုကောင်းမွန်စေသည်။သာဓကအားဖြင့်နာနတ်သီဟက်ပီနန်းစံစဉ်ကတည်ဆောက်ခဲ့သောမင်္ဂလာဒုံဘုရားတွင်ပြည်တွင်း၌ထုတ်လုပ်ခြင်းမရှိသောဖဲနှင့်ကတ္တီပါအ၀တ်အထည်များပါ၀င်သည်။'
  ),
  Dress(
    title: 'မင်္ဂလာဆောင်ဝတ်စုံ ၀၃',
    image: 'assets/images/3.jpg',
    price: 200000,
    rating: 4,
    isMarked: false,
    description: 'ပုဂံခေတ်တွင်အထည်အများဆုံးအသုံးပြုသည့်အထည်ဖြစ်ပြီးဝါ၊ပိုး၊ဖဲနှင့်ကတ္တီပါစသည့်အခြားအထည်အလိပ်များကိုလည်းမြန်မာအဝတ်အထည်များတွင်အသုံးပြုသည်။အိမ်နီးချင်းလူ့အဖွဲ့အစည်းများနှင့်ကုန်သွယ်မှုသည်ပျူခေတ်နှင့်ကုန်သွားပြီးရိုးရာဓလေ့ထုံးစံနှင့်၀တ်စုံအတွက်အသုံးပြုသည့်တင်သွင်းသည့်အထည်အလိပ်များဖြင့်ပစ္စည်းယဉ်ကျေးမှုကိုပိုမိုကောင်းမွန်စေသည်။သာဓကအားဖြင့်နာနတ်သီဟက်ပီနန်းစံစဉ်ကတည်ဆောက်ခဲ့သောမင်္ဂလာဒုံဘုရားတွင်ပြည်တွင်း၌ထုတ်လုပ်ခြင်းမရှိသောဖဲနှင့်ကတ္တီပါအ၀တ်အထည်များပါ၀င်သည်။'
  ),
  Dress(
    title: 'မင်္ဂလာဆောင်ဝတ်စုံ ၀၄',
    image: 'assets/images/4.jpg',
    price: 200000,
    rating: 4,
    isMarked: false,
    description: 'ပုဂံခေတ်တွင်အထည်အများဆုံးအသုံးပြုသည့်အထည်ဖြစ်ပြီးဝါ၊ပိုး၊ဖဲနှင့်ကတ္တီပါစသည့်အခြားအထည်အလိပ်များကိုလည်းမြန်မာအဝတ်အထည်များတွင်အသုံးပြုသည်။အိမ်နီးချင်းလူ့အဖွဲ့အစည်းများနှင့်ကုန်သွယ်မှုသည်ပျူခေတ်နှင့်ကုန်သွားပြီးရိုးရာဓလေ့ထုံးစံနှင့်၀တ်စုံအတွက်အသုံးပြုသည့်တင်သွင်းသည့်အထည်အလိပ်များဖြင့်ပစ္စည်းယဉ်ကျေးမှုကိုပိုမိုကောင်းမွန်စေသည်။သာဓကအားဖြင့်နာနတ်သီဟက်ပီနန်းစံစဉ်ကတည်ဆောက်ခဲ့သောမင်္ဂလာဒုံဘုရားတွင်ပြည်တွင်း၌ထုတ်လုပ်ခြင်းမရှိသောဖဲနှင့်ကတ္တီပါအ၀တ်အထည်များပါ၀င်သည်။'
  ),
  Dress(
    title: 'မင်္ဂလာဆောင်ဝတ်စုံ ၀၅',
    image: 'assets/images/5.jpg',
    price: 500000,
    rating: 4,
    isMarked: false,
    description: 'ပုဂံခေတ်တွင်အထည်အများဆုံးအသုံးပြုသည့်အထည်ဖြစ်ပြီးဝါ၊ပိုး၊ဖဲနှင့်ကတ္တီပါစသည့်အခြားအထည်အလိပ်များကိုလည်းမြန်မာအဝတ်အထည်များတွင်အသုံးပြုသည်။အိမ်နီးချင်းလူ့အဖွဲ့အစည်းများနှင့်ကုန်သွယ်မှုသည်ပျူခေတ်နှင့်ကုန်သွားပြီးရိုးရာဓလေ့ထုံးစံနှင့်၀တ်စုံအတွက်အသုံးပြုသည့်တင်သွင်းသည့်အထည်အလိပ်များဖြင့်ပစ္စည်းယဉ်ကျေးမှုကိုပိုမိုကောင်းမွန်စေသည်။သာဓကအားဖြင့်နာနတ်သီဟက်ပီနန်းစံစဉ်ကတည်ဆောက်ခဲ့သောမင်္ဂလာဒုံဘုရားတွင်ပြည်တွင်း၌ထုတ်လုပ်ခြင်းမရှိသောဖဲနှင့်ကတ္တီပါအ၀တ်အထည်များပါ၀င်သည်။'
  ),
  Dress(
    title: 'မင်္ဂလာဆောင်ဝတ်စုံ ၀၆',
    image: 'assets/images/6.jpg',
    price: 200000,
    rating: 4,
    isMarked: false,
    description: 'ပုဂံခေတ်တွင်အထည်အများဆုံးအသုံးပြုသည့်အထည်ဖြစ်ပြီးဝါ၊ပိုး၊ဖဲနှင့်ကတ္တီပါစသည့်အခြားအထည်အလိပ်များကိုလည်းမြန်မာအဝတ်အထည်များတွင်အသုံးပြုသည်။အိမ်နီးချင်းလူ့အဖွဲ့အစည်းများနှင့်ကုန်သွယ်မှုသည်ပျူခေတ်နှင့်ကုန်သွားပြီးရိုးရာဓလေ့ထုံးစံနှင့်၀တ်စုံအတွက်အသုံးပြုသည့်တင်သွင်းသည့်အထည်အလိပ်များဖြင့်ပစ္စည်းယဉ်ကျေးမှုကိုပိုမိုကောင်းမွန်စေသည်။သာဓကအားဖြင့်နာနတ်သီဟက်ပီနန်းစံစဉ်ကတည်ဆောက်ခဲ့သောမင်္ဂလာဒုံဘုရားတွင်ပြည်တွင်း၌ထုတ်လုပ်ခြင်းမရှိသောဖဲနှင့်ကတ္တီပါအ၀တ်အထည်များပါ၀င်သည်။'
  ),
];
List<Dress>recommendList=[
  Dress(
      title: 'မင်္ဂလာဆောင်ဝတ်စုံ ၀၇',
      image: 'assets/images/7.jpg',
      price: 300000,
      rating: 4,
      isMarked: false,
      description: 'ပုဂံခေတ်တွင်အထည်အများဆုံးအသုံးပြုသည့်အထည်ဖြစ်ပြီးဝါ၊ပိုး၊ဖဲနှင့်ကတ္တီပါစသည့်အခြားအထည်အလိပ်များကိုလည်းမြန်မာအဝတ်အထည်များတွင်အသုံးပြုသည်။အိမ်နီးချင်းလူ့အဖွဲ့အစည်းများနှင့်ကုန်သွယ်မှုသည်ပျူခေတ်နှင့်ကုန်သွားပြီးရိုးရာဓလေ့ထုံးစံနှင့်၀တ်စုံအတွက်အသုံးပြုသည့်တင်သွင်းသည့်အထည်အလိပ်များဖြင့်ပစ္စည်းယဉ်ကျေးမှုကိုပိုမိုကောင်းမွန်စေသည်။သာဓကအားဖြင့်နာနတ်သီဟက်ပီနန်းစံစဉ်ကတည်ဆောက်ခဲ့သောမင်္ဂလာဒုံဘုရားတွင်ပြည်တွင်း၌ထုတ်လုပ်ခြင်းမရှိသောဖဲနှင့်ကတ္တီပါအ၀တ်အထည်များပါ၀င်သည်။'
  ),
  Dress(
      title: 'မင်္ဂလာဆောင်ဝတ်စုံ ၀၈',
      image: 'assets/images/8.jpg',
      price: 300000,
      rating: 4,
      isMarked: false,
      description: 'ပုဂံခေတ်တွင်အထည်အများဆုံးအသုံးပြုသည့်အထည်ဖြစ်ပြီးဝါ၊ပိုး၊ဖဲနှင့်ကတ္တီပါစသည့်အခြားအထည်အလိပ်များကိုလည်းမြန်မာအဝတ်အထည်များတွင်အသုံးပြုသည်။အိမ်နီးချင်းလူ့အဖွဲ့အစည်းများနှင့်ကုန်သွယ်မှုသည်ပျူခေတ်နှင့်ကုန်သွားပြီးရိုးရာဓလေ့ထုံးစံနှင့်၀တ်စုံအတွက်အသုံးပြုသည့်တင်သွင်းသည့်အထည်အလိပ်များဖြင့်ပစ္စည်းယဉ်ကျေးမှုကိုပိုမိုကောင်းမွန်စေသည်။သာဓကအားဖြင့်နာနတ်သီဟက်ပီနန်းစံစဉ်ကတည်ဆောက်ခဲ့သောမင်္ဂလာဒုံဘုရားတွင်ပြည်တွင်း၌ထုတ်လုပ်ခြင်းမရှိသောဖဲနှင့်ကတ္တီပါအ၀တ်အထည်များပါ၀င်သည်။'
  ),
  Dress(
      title: 'မင်္ဂလာဆောင်ဝတ်စုံ ၀၉',
      image: 'assets/images/9.jpg',
      price: 200000,
      rating: 4,
      isMarked: false,
      description: 'ပုဂံခေတ်တွင်အထည်အများဆုံးအသုံးပြုသည့်အထည်ဖြစ်ပြီးဝါ၊ပိုး၊ဖဲနှင့်ကတ္တီပါစသည့်အခြားအထည်အလိပ်များကိုလည်းမြန်မာအဝတ်အထည်များတွင်အသုံးပြုသည်။အိမ်နီးချင်းလူ့အဖွဲ့အစည်းများနှင့်ကုန်သွယ်မှုသည်ပျူခေတ်နှင့်ကုန်သွားပြီးရိုးရာဓလေ့ထုံးစံနှင့်၀တ်စုံအတွက်အသုံးပြုသည့်တင်သွင်းသည့်အထည်အလိပ်များဖြင့်ပစ္စည်းယဉ်ကျေးမှုကိုပိုမိုကောင်းမွန်စေသည်။သာဓကအားဖြင့်နာနတ်သီဟက်ပီနန်းစံစဉ်ကတည်ဆောက်ခဲ့သောမင်္ဂလာဒုံဘုရားတွင်ပြည်တွင်း၌ထုတ်လုပ်ခြင်းမရှိသောဖဲနှင့်ကတ္တီပါအ၀တ်အထည်များပါ၀င်သည်။'
  )
];